In [1]:
import numpy as np
import pandas as pd

In [3]:
columns = ['W','X','Y','Z']

In [4]:
index = ['A','B','C','D','E']

In [5]:
np.random.randint(-100,100)

-6

In [7]:
data = np.random.randint(-100,100,(5,4))

In [12]:
df = pd.DataFrame(data,index,columns)

In [13]:
df.head()

    W   X   Y   Z
A -68  86  87 -80
B   4  65 -46  31
C -75 -60  63 -30
D  -6 -92  64  46
E  94 -59 -60  -1

In [21]:
df['W']

A   -68
B     4
C   -75
D    -6
E    94
Name: W, dtype: int64

In [22]:
type(df['W'])

pandas.core.series.Series

In [23]:
df[['W','X','Y']]

    W   X   Y
A -68  86  87
B   4  65 -46
C -75 -60  63
D  -6 -92  64
E  94 -59 -60

In [24]:
df['new'] = df['W'] + df['Y']

In [25]:
df

    W   X   Y   Z  new
A -68  86  87 -80   19
B   4  65 -46  31  -42
C -75 -60  63 -30  -12
D  -6 -92  64  46   58
E  94 -59 -60  -1   34

In [26]:
df.drop('new',axis=1,inplace=True)

In [27]:
df

    W   X   Y   Z
A -68  86  87 -80
B   4  65 -46  31
C -75 -60  63 -30
D  -6 -92  64  46
E  94 -59 -60  -1